app/controllers/diaries_controller.rb

  def index
    @diaries = Diary.all
---
SELECT "diaries".* FROM "diaries"

  def create
    @diary = Diary.new(diary_params)

    respond_to do |format|
      if @diary.save
---
INSERT INTO "diaries" ("title", "body", "created_at", "updated_at") VALUES ('2026/01/20', 'aaaaa', '2026-01-20 00:47:09.810991', '2026-01-20 00:47:09.810991') RETURNING "id"

  def destroy
    @diary.destroy!
---
DELETE FROM "diaries" WHERE "diaries"."id" = 1

    def set_diary
      @diary = Diary.find(params.expect(:id))
---
SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = 10 LIMIT 1